[
  {
    "id": "1",
    "date": "2025-07-15",
    "title": "Judge Dismisses Lawsuit, Allows Tree Removal",
    "excerpt": "On Friday, July 18, 2025, members of FFGP spoke with Brooklyn News 12 to voice their disappointment in the ruling. &quot;This decision represents a setback not only for Fort Greene Park but for all New Yorkers who believe in protecting our city's green spaces and honoring our shared historical and cultural heritage,&quot; said FFGP President Kelly Schaffer.\nDespite the court's decision, the group emphasized that their fight is far from over. **FFGP vowed to continue** mobilizing neighbors, raising awareness, and pressing city officials to adopt the community's counter-proposal — one that preserves the tree canopy, restores historic landscape features, and ensures the park remains accessible, sustainable, and welcoming for future generations.",
    "source": "News 12",
    "sourceUrl": "https://brooklyn.news12.com/judge-tosses-lawsuit-over-fort-greene-park-allowing-city-to-cut-down-trees ",
    "author": "Staff Reporter",
    "containsVideo": true
  },
  {
    "id": "2",
    "date": "2025-05-14",
    "title": "'Living for the City' Discusses Fort Greene Park Controversy",
    "excerpt": "During WBAI Radio's &quot;Living for the City&quot; program on May 14, 2025, hosts discussed Mt. Prospect Park and Fort Greene Park, explaining the situation well.",
    "source": "WBAI Radio",
    "sourceUrl": "https://www.google.com",
    "author": "WBAI Radio",
    "containsVideo": false
  },
  {
    "id": "3",
    "date": "2025-04-15",
    "title": "To tree, or not to tree? Advocates, city continue legal battle over Fort Greene Park revamp",
    "excerpt": "The lush but aging greenspace was chosen as one of eight city parks to be overhauled by the Parks Without Borders program in 2016. Nine years later, the projects have wrapped up in the other seven parks — but haven't begun at Fort Greene.\nThat's because a group of local activists, the Friends of Fort Greene Park, believe the project will do more harm than good, and doubt the city's studies that say otherwise. In an effort to stall the project and demand more information about the plan, the Friends have filed three lawsuits against the city since 2018. ",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/legal-battle-trees-fort-greene-park/",
    "author": "Kirstyn Brendlen",
    "containsVideo": false
  },
  {
    "id": "4",
    "date": "2025-04-12",
    "title": "Advocates Battle NYC Parks Plan to Cut 78 Trees",
    "excerpt": "A Fort Greene nonprofit group took the city Parks Department to court on March 27, arguing the city agency failed to conduct a full environmental review before approving a $24 million redesign of Fort Greene Park that would result in the removal of 78 trees.\nFriends of Fort Greene Park (FFGP) argued that the Parks Department violated the State Environmental Quality Review Act (SEQRA), according to a press release.",
    "source": "BK Reader",
    "sourceUrl": "https://www.bkreader.com/non-profit-community/advocates-battle-nyc-parks-plan-to-cut-78-trees-in-fort-greene-park-10498705",
    "author": "BK Reader Staff",
    "containsVideo": false
  },
  {
    "id": "5",
    "date": "2025-04-03",
    "title": "Long-Running Controversy Over Fort Greene Tree Plan Continues",
    "excerpt": "The controversy over a $24 million redesign of Fort Greene Park, which will axe 78 mature trees, continues, according to Pix11. Set for 2026, the project swaps invasive Norway maples for 200 native ones, adds ADA entrances, and fixes drainage, per the park's Conservancy, which says 30 of the trees are unhealthy, 24 are invasive and 24 threaten pipes. The Friends of Fort Greene Park, however, which has been fighting the plan since 2017, claims it skipped environmental reviews — **decreasing shade, replacing green swaths with concrete and destroying park features designed by famous landscape artists.**",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2025/04/03/long-running-controversy-over-fort-greene-tree-plan-continues/",
    "author": "Brooklyn Eagle Staff",
    "containsVideo": false
  },
  {
    "id": "6",
    "date": "2025-04-01",
    "title": "Residents Sue to Stop Tree Cutting in $24M Fort Greene Park Overhaul",
    "excerpt": "FOX5 New York reports that a $24 million project to redesign Fort Greene Park faces legal opposition from local residents. The plan calls for the removal of 78 trees to make way for pedestrian plazas and increased accessibility, but opponents say **the project will harm the environment and community health**. Residents filed a lawsuit arguing that tree loss will impact air quality, wildlife and shade in a neighborhood already affected by asthma and heat.",
    "source": "FOX5 New York",
    "sourceUrl": "https://www.youtube.com/watch?v=6y5V3RM7AgM",
    "author": "Kendall Green",
    "containsVideo": true
  },
  {
    "id": "7",
    "date": "2025-03-31",
    "title": "Brooklyn Residents Fight Plan to Chop Down 78 Trees",
    "excerpt": "Leaf these trees alone.\nPlant-loving locals are looking to block the city from chopping down 78 trees in Fort Greene Park – a move they say would turn the greenspace into a **&quot;summer frying pan.&quot;**\nA group of residents in Brooklyn's trendy Fort Greene is suing the city and fighting with the parks conservancy over a plan for a pedestrian plaza despite officials pledging to replace the healthy trees with 300 saplings.",
    "source": "New York Post",
    "sourceUrl": "https://nypost.com/2025/03/31/us-news/locals-fight-plan-to-chop-down-78-healthy-trees-in-for-greene-park-saying-itll-create-a-summer-frying-pan/",
    "author": "Nicole Rosenthal",
    "containsVideo": false
  },
  {
    "id": "8",
    "date": "2025-03-27",
    "title": "'Tree Fight' Continues to Grow in Brooklyn",
    "excerpt": "Two organizations that want to make improvements to Fort Greene Park have been arguing for decades. As CBS News New York's Kristie Keleshian reports, the fight has made its way to court.",
    "source": "CBS News",
    "sourceUrl": "https://www.cbsnews.com/newyork/video/tree-fight-continues-to-grow-in-brooklyn/",
    "author": "Kristie Keleshian",
    "containsVideo": true
  },
  {
    "id": "9",
    "date": "2021-04-14",
    "title": "City Plans To Chop Trees for Fort Greene Park Redesign, Declines to Say How Many",
    "excerpt": "Parks Department lumberjacks will be chopping down trees in Fort Greene Park as part of a recently-relaunched $24 million makeover.\nThe group's first lawsuit in 2017 revealed that **officials lied about many of the trees being sick and near-death to advance their plans**, and Braun worried that the city might try and do the same again in the name of aesthetics.\n&quot;Obviously the trees that are in truly bad shape, you don't want a tree falling on somebody, nobody objects to that,&quot; said Braun. **&quot;We would oppose the removal of healthy mature shade trees for design purposes.&quot;**\nAn attorney representing the locals opposed to the tree removal **demanded that the city allow for full transparency, as well as sufficient input for neighbors.** &quot;It is clear that the prior plan for the Park required the Parks Department to prepare an Environmental Impact Statement prior to approving any project for the Park,&quot; said Richard Lippes in a statement.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/state-pol-calls-on-city-to-rethink-embattled-fort-greene-park-redesign/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "10",
    "date": "2020-9-11",
    "title": "Residents Demand Answers From City On Embattled Fort Greene Park Revamp",
    "excerpt": "The agency recently adjusted the proposal's timeline, scheduling the completion of the procurement process for November 2020. That would pave the way for a 12-18 month construction process, and the city's apparent moves to plough ahead stunned the activists. &quot;It just shows that the **Parks Commissioner [Mitchell Silver] is forcing through this unpopular and legally questionable proposal** of his.&quot;A lawyer for Friends of Fort Greene Park said last week that officials need to address the judge's order before they can proceed.\n&quot;They have to produce a piece of paper [saying] why they believe that they're not subject to SEQR,&quot; said Michael Gruen. **&quot;All of this the court said must be addressed** and the court isn't going to guess how Parks comes out on it, it's up to the Parks Department to think it through and express it in an intelligent way.&quot;\nFriends of Fort Greene Park and Gruen in August launched a blitz of document requests from city and state agencies about the project, but they have yet to get any files.\nThe residents group previously successfully sued the agency, when **a judge ruled that the Department had lied about the health of dozens of the trees to advance their plan**, and another local opponent of the plan worried that the agency was again looking to override their concerns.\n**&quot;It just goes to show you the lengths they're willing to go through while being untruthful,&quot;** said Monique Cumberbatch a resident of the Kingsview Homes cooperative housing complex adjacent to the park.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/residents-question-fort-green-park-makeover/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "11",
    "date": "2020-05-20",
    "title": "State Pol Calls On City To Rethink Embattled Fort Greene Park Redesign",
    "excerpt": "**&quot;We don't want to take out trees that have longevity in front of them and replace them with immature trees that would take decades to become mature,&quot;** Assemblyman Walter Mosley said. He emphasized the importance of preserving existing green space.\nThe section of the park across from public housing has not seen significant investment since the 1970s, unlike the southern half near Dekalb Avenue. Locals also worried **the redesign could spur gentrification.**",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/state-pol-calls-on-city-to-rethink-fort-greene-park-redesign/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "12",
    "date": "2020-05-01",
    "title": "The Battle of Fort Greene — Landscape Architecture Magazine",
    "excerpt": "**For generations, towering trees in the northwest corner of Fort Greene Park have sheltered outdoor celebrations of residents** from the New York City Housing Authority apartments located directly across the street.\n**&quot;This is the reason I stayed in Brooklyn,&quot;** said Stacy Williams, says Stacy Williams, who has lived in the Ingersoll Houses for the past 28 years. Nearby, her granddaughter played on Bye's mounds. **“Any function, this is the park to go to.”** ... A city proposal would remove the mounds for a pedestrian thoroughfare, creating space for vendors and events.\nAs her granddaughter played atop the grass-topped mounds, Williams was dismayed that **the landforms would be replaced with concrete** ... &quot;The park don't really need this glamorous thing you're putting in it.&quot;",
    "source": "American Society of Landscape Architects",
    "sourceUrl": "/pdfs/20200430 THE BATTLE OF FORT GREENE - Landscape Architecture Magazine.pdf",
    "author": "Tom Stoelker",
    "containsVideo": false
  },
  {
    "id": "13",
    "date": "2020-02-19",
    "title": "City to appeal Fort Greene Park state judge's order",
    "excerpt": "City legal eagles filed a notice of appeal on Feb. 13 against state Supreme Court Judge Julio Rodriguez III's **January order**¹ for the agency to produce evidence that their $10.5 million park overhaul — which includes felling 83 trees — wouldn't have a significant impact on the neighborhood's namesake lawn, siding with local environmental advocates.\n¹ https://www.brooklynpaper.com/state-judge-orders-city-to-study-fort-greene-park-revamp-environmental-harms/",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/city-to-appeal-fort-greene-park-state-judges-order/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "14",
    "date": "2020-01-14",
    "title": "Fort Greene Park Trees Get Stay Of Execution",
    "excerpt": "&quot;The Parks Department fell short in its responsibilities to be transparent and accountable throughout its Parks Without Borders design process,&quot; said Friends of Fort Greene President Ling Hsu.\n&quot;Thankfully, Fort Greene residents came together and prevailed in two lawsuits in a row, saving mature trees from the meaningless destruction the city intended to begin in 2018. The ruling is a reminder to the Parks Department to resume its role as a steward of greenery for the community at historic Fort Greene Park,&quot; she added.",
    "source": "Kings County Politics",
    "sourceUrl": "https://www.kingscountypolitics.com/fort-greene-park-trees-get-stay-of-execution/",
    "author": "Chaya Gurkov",
    "containsVideo": false
  },
  {
    "id": "15",
    "date": "2020-01-13",
    "title": "Fort Greene Park Trees Saved As Locals Beat City In Court",
    "excerpt": "Friends of Fort Greene Park — local advocates **fighting plans to tear down 83 trees** in the Brooklyn green space — won the second of two lawsuits against the Park Department in New York State Supreme Court last week, the group announced.\n&quot;This decision should awaken the Department to reality,&quot; said legal advisor Michael Gruen. **&quot;Environmental regulation is not enacted to be evaded** as if it were merely an annoyance.&quot;\nGeorgette Poe, an FFGP member and resident of nearby NYCHA housing, celebrated the ruling as **a victory for the public housing community**, as the plan would have cut down 58 mature trees in the northwest section nearest the Ingersoll and Whitman houses.\n&quot;The City came in, **didn't ask us what we needed and then didn't listen to the neighborhood,&quot;** said Poe. &quot;[They] wanted to take our park away, telling us we're not welcome anymore.&quot;\n&quot;It just doesn't make sense,&quot; said FFGP member Arija Flowers. &quot;Parks are supposed to be about trees and green spaces, birds and bees. **We don't need another paved plaza.**&quot;",
    "source": "Patch",
    "sourceUrl": "https://patch.com/new-york/new-york-city/fort-greene-park-trees-saved-locals-beat-city-court",
    "author": "Kathleen Culliton",
    "containsVideo": false
  },
  {
    "id": "16",
    "date": "2020-01-13",
    "title": "City's plan to remove trees from Fort Greene Park hits a snag",
    "excerpt": "And though the letter says that about 267 replacement trees will be planted in Fort Greene Park, &quot;it does not provide any explanation as to its reasoning in determining that neither the **destruction of apparently healthy trees** nor the addition of trees throughout the park has the potential for an adverse impact,&quot; the judge said in his ruling.\nThe final reason the letter is deficient is that &quot;there is no real explanation as to why [the Parks Department] concluded there is **no possibility of any negative aesthetic and cultural impacts** or of negative impacts to the **neighborhood character**,&quot; the judge wrote.",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2020/01/13/fort-greene-sierra-club-lawsuit/",
    "author": "Lore Croghan",
    "containsVideo": false
  },
  {
    "id": "17",
    "date": "2020-01-13",
    "title": "Judge Halts City's Plan To Raze Dozens Of Trees In Fort Greene Park",
    "excerpt": "In a key victory for community activists and tree lovers, a state Supreme Court judge has ordered the city to reassess a fiercely contested renovation of a beloved Brooklyn park that would have razed more than 80 trees.\nIn a statement, Kate Bartholomew, chair of the Atlantic Chapter of the Sierra Club, said, &quot;It is heartening to see that Justice Rodriguez also recognizes that the New York City Department of Parks and Recreation **failed to adequately assess the implications of its design decision** when choosing to move forward with a plan to alter and renew Fort Greene Park.&quot;",
    "source": "Gothamist",
    "sourceUrl": "https://gothamist.com/news/judge-halts-citys-plan-raze-dozens-trees-fort-greene-park",
    "author": "Elizabeth Kim",
    "containsVideo": false
  },
  {
    "id": "18",
    "date": "2019-12-09",
    "title": "Controversy over Fort Greene Park's redesign inspires art installation",
    "excerpt": "An artist has stepped up to support activists who are fighting to save trees and historic design features the city plans to tear down in Fort Greene Park.\nOosterlaken told the Brooklyn Eagle the concept for her art installation started with a broad question: **Who should be designing public spaces?**\nWhile doing random research, she wound up reading about the Parks Without Borders program and the controversy it sparked in Fort Greene. She sought out the Friends of Fort Greene Park to find out more about the issue.&quot;The main thing that was wrong was that **people didn't feel listened to**,&quot; Oosterlaken said she discovered. &quot;I believe there are ways to change the park — but it shouldn't be done this way.&quot;\nIt's an enormous illustration, inscribed with quotes from local residents about what the park means to them and what they think should and shouldn'’'t be done to change it.\n&quot;We need repairs. We should preserve the natural beauty of the park,&quot; one inscription says.",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2019/12/09/controversy-over-fort-greene-parks-redesign-inspires-art-installation/",
    "author": "Lore Croghan",
    "containsVideo": false
  },
  {
    "id": "19",
    "date": "2019-10-21",
    "title": "Group of residents sue Fort Greene Parks Department in hopes of saving green space",
    "excerpt": "Residents are dismayed at the Parks Department's plan to **cut down dozens of old trees, pave over grass and greenery**, and replace them with a **concrete plaza**.\nResidents say the park is used for activities on a regular basis. They say the Parks Department has been working on a **Parks Without Borders program that has not been transparent**. Residents who live near Fort Greene Park say they have taken the city to court twice.\nThe first time, they say they **demanded transparency from redacted paperwork** concerning the state of the park and recommendations for changes. Residents won that lawsuit.\nThe unredacted report showed that the recommendations of the landscape architect were consistent with what residents want. That's why the Parks Department redacted it.\nNow, they have filed a second lawsuit asking the city to conduct an environmental review of the impact of cutting down the trees and removing the grass. One person referred to it as a **frying pan effect**, because **without the trees and all the cement**, it's just going to capture heat.",
    "source": "News 12",
    "sourceUrl": "https://brooklyn.news12.com/group-of-residents-sue-fort-greene-parks-department-in-hopes-of-saving-green-space-41211710",
    "author": "News 12 Staff",
    "containsVideo": true
  },
  {
    "id": "20",
    "date": "2019-10-15",
    "title": "NYC 'Parks Without Borders' program draws controversy",
    "excerpt": "Of nine park-goers who said they lived nearby, seven had heard of plans to renovate the park, and only one expressed unambivalent enthusiasm about the changes. Other opinions included “They should leave the park alone” and “They're trying to throw us out of the park.&quot;\n&quot;I've been here over 50 years, and now they want to **take down the trees** and do changes,&quot; said a man walking his bike between the mounds. Terri Ball, who has family in the Whitman houses, said she's **happy about the repairs, but hates to see those grassy mounds go.** &quot;I've attended two or three weddings on the mounds,&quot; said Ball.",
    "source": "City & State NY",
    "sourceUrl": "https://www.cityandstateny.com/policy/2019/10/nyc-parks-without-borders-program-draws-controversy/176820/",
    "author": "Kendra Hurley",
    "containsVideo": false
  },
  {
    "id": "21",
    "date": "2019-10-08",
    "title": "Fort Greene Park Tree Sacrifice — City must axe Fort Greene Park trees to make way for new life: Park steward",
    "excerpt": "**The city wants to destroy a total of 83 trees — 52 to make way for a grand paved plaza.**\nAccording to Fletcher, who said the felled trees will be largely replaced by a so-called &quot;understory garden&quot;.\nAn attorney for the plaintiffs accused Fletcher of trying to help the city **dodge a transparent environmental review**, saying if the city was so interested in creating an ecological wonderland, their laywers might have mentioned the vaunted understory garden during oral arguments held last month.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/city-must-axe-fort-greene-park-trees-to-make-way-for-new-life-park-steward/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "22",
    "date": "2019-10-09",
    "title": "DISAPPEARED COMMENTS on latest Brooklyn Paper story",
    "excerpt": "In case you missed it, because of new media ownership, the Brooklyn Paper story 10/8/19, written by Kevin Duggan about the Fort Greene Conservancy's new director trying to justify the 'axing' of trees in Fort Greene Park, **no longer has the many neighborhood comments to that story available to be read**. The article itself remains accessible-but the reactions of outrage & disbelief about the plan are disappeared.\nThe following are some of the notable comments we were able to capture before they were eliminated. They are worth reading.",
    "source": "FFGP",
    "sourceUrl": "/pdfs/20191008 Fort Greene Park Tree Sacrifice - City must axe Fort Greene Park trees to make way for new life - Park steward.pdf",
    "author": "FFGP",
    "containsVideo": false
  },
  {
    "id": "23",
    "date": "2019-09-12",
    "title": "Fort Greene Park neighbors fight city's plans to remodel park",
    "excerpt": "The New York City Department of Parks and Recreation says they want to **remove 83 trees** in Fort Greene Park in Brooklyn, in order to make room for a brand new park. But those living nearby are **fighting in court to keep the trees around.**\nVideo mirror: https://www.youtube.com/watch?v=mXqzc42bRFk",
    "source": "FOX5 New York",
    "sourceUrl": "https://www.fox5ny.com/news/fort-greene-park-neighbors-fight-citys-plans-to-remodel-park",
    "author": "Richard Giacovas",
    "containsVideo": true
  },
  {
    "id": "24",
    "date": "2019-09-10",
    "title": "Fort Greene Park neighbors fight city's plans to remodel park",
    "excerpt": "The city's redesign of Fort Greene Park calls for **a plaza with 13,300 square feet of impermeable paving to replace grass mounds** designed by artist A.E. Bye.\nLippes included a Parks Department flyer in his court filings that says, &quot;A large, healthy tree removes almost **70 times more air pollution** each year than a small, newly planted tree.&quot;\nThe Parks Department's plan to cut down 83 trees &quot;shows the City of New York does not care about how they will **affect people in black and brown communities**,&quot; one of the supporters, Georgette Poe, told the Brooklyn Eagle. &quot;They want to make Fort Greene Park look like Washington, D.C., with paving and a monument,&quot; said Poe, who lives in the Walt Whitman Houses. &quot;We're Brooklyn. **We need our shade.**&quot;",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2019/09/10/save-our-trees-advocates-have-their-day-in-court/",
    "author": "Lore Croghan",
    "containsVideo": false
  },
  {
    "id": "25",
    "date": "2019-07-15",
    "title": "WBAI Living for the City - Fort Greene Park",
    "excerpt": "Even though we NYers live in the quintessential urban environment—and all that goes along with city dwelling—when someone messes with our nature, we get pissed and we rally. That's just what's been going on in Brooklyn's Fort Greene Park, where the **Parks Department**—many say needlessly—**plans to destroy dozens of mature trees as part of a $10.5 million (for now) redevelopment plan**. And, as true with much of the de Blasio administration's actions, a lot has been going on behind the scenes, with the public often the last to know. So, what's really going on and why? With me is Ling Hsu, president of the Friends of Fort Greene Park (FFGP) & current chair of the Fort Greene Association and Lucy Koteen, a member of both organizations; they are also plaintiffs in a Sierra Club lawsuit against the city's Parks Department.",
    "source": "WBAI Radio",
    "sourceUrl": "https://archive.org/details/linghsulucykoteenseg71519",
    "author": "Michael G. Haskins",
    "containsVideo": false
  },
  {
    "id": "26",
    "date": "2019-06-13",
    "title": "Fort Greene Park Report Shows City Ignored Architect's Advice",
    "excerpt": "The city **didn't follow a landscape architect's recommendations** in their renovation plans for Fort Greene Park and then **tried to hide those recommendations from the public**.\n&quot;We couldn't help but wonder what the text under all those black splotches said, and why the Parks Department would not want us to see it,&quot; attorney Michael Gruen said. &quot;The more adamantly they refused, the more curious we became. In the end, we learned that the report gave sensible advice — and Parks refused to follow it.&quot;\n&quot;The recommendations from an expert of Nancy Owens' caliber are in line with community feedback,&quot; FFGP President Ling Hsu said. &quot;**Over 500 petitioners have said all along to repair, not to pave over greenery** with a hardscape plaza for commercial events in our beloved park.&quot;",
    "source": "Patch",
    "sourceUrl": "https://patch.com/new-york/fortgreene/city-forced-release-162-pages-fort-greene-park-project",
    "author": "Anna Quinn",
    "containsVideo": false
  },
  {
    "id": "27",
    "date": "2019-05-01",
    "title": "",
    "excerpt": "Friends of Fort Greene Park Rally in front of Council Member Laurie Cumbo's office.",
    "source": "NY News 1",
    "sourceUrl": "https://www.youtube.com/watch?v=wXnkSGpZ4FU",
    "author": "Anthony Pascale",
    "containsVideo": true
  },
  {
    "id": "28",
    "date": "2018-10-18",
    "title": "Little guys win big: City must give locals complete report related to Ft. Greene Park's redesign, judge rules",
    "excerpt": "&quot;You wonder why on earth the Parks Department was so insistent on removing about one-third of the report,&quot; the attorney said. &quot;I think that **there are clearly flaws with the design of the park, and the concept of removing a very large number of trees**.&quot;\nThe ruling isn't just a win for the locals, according to Gruen, who said **the decision benefits everyone seeking information from public officials.**",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/little-guys-win-big-city-must-give-locals-complete-report-related-to-ft-greene-parks-redesign-judge-rules/",
    "author": "Julianne Cuba",
    "containsVideo": false
  },
  {
    "id": "29",
    "date": "2017-12-03",
    "title": "Friends of Fort Greene Park - Brooklyn 12 by Torri Singer",
    "excerpt": "Residents demand a democratic and transparent process to transform our neighborhood park.",
    "source": "News 12",
    "sourceUrl": "https://www.youtube.com/watch?v=8Km95GWgbwc",
    "author": "Torri Singer",
    "containsVideo": true
  },
  {
    "id": "30",
    "date": "2017-08-30",
    "title": "Residents Protest Fort Greene Park Renovation Plan",
    "excerpt": "Brittany Brandon, an Ingersoll Houses resident, said, &quot;My child has been playing here for as long as I can remember. With **the plaza** being here, it's **going to disrupt all those things that our kids love**.&quot;\n**&quot;This is what keeps the community together,&quot;** said Joe Brown, who lives in the projects across Myrtle Avenue. Brown said that leveling the mounds would discourage his neighbors from coming to the park. **&quot;By doing that, you kinda segregate the community.&quot;**",
    "source": "Patch",
    "sourceUrl": "https://patch.com/new-york/fortgreene/residents-protest-fort-greene-park-renovation-plan",
    "author": "Kathleen Culliton",
    "containsVideo": false
  },
  {
    "id": "31",
    "date": "2017-05-22",
    "title": "Parks Commish 'Spin' Class For Workers After Disastrous Ft.Greene Pk Redesign Community Meeting ",
    "excerpt": "&quot;This is clearly Silver. He wants to take one of the oldest parks in the city and remake it, leave his stamp.&quot;\nParks Commissioner Mitchell Silver is receiving some major pushback on his proposed redesign of Ft. Greene Park as part of his Parks Without Borders initiative. **Rebuffed by strong community opposition** a month earlier at a Parks' Community Input Meeting, **an &quot;angry&quot; Silver presided over a more than two hour lecture** for park employees at the Queens theater on, at least in part, how to &quot;spin&quot; public opposition to unpopular projects.\nDuring the lecture **Silver blamed the community's poor reaction not on the plan but instead on the park employees who presented it**, according to several Parks Department employees who attended.",
    "source": "A Walk In The Park",
    "sourceUrl": "https://awalkintheparknyc.blogspot.com/2017/05/parks-commish-spin-class-for-workers.html",
    "author": "Geoffrey Croft",
    "containsVideo": false
  },
  {
    "id": "32",
    "date": "2017-05-05",
    "title": "Longtime residents: Don't gentrify Fort Greene Park",
    "excerpt": "Plans to makeover Fort Greene Park must include perks for the people who live in the public housing complexes surrounding it and **shouldn't just create a fancy facade to make the meadow look good for gentrifiers**, neighbors demanded at a meeting on Wednesday night.\n&quot;**We don't want a vanity project, we don't want a promenade, we don't want more pavement**,” said one Fort Greener to Brooklyn Parks Commissioner Marty Maher, who led the meeting. &quot;We want more grass, more intimate spaces, we want more recreational opportunities for our kids and seniors. **This is everyone's backyard.**&quot;",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/longtime-residents-dont-gentrify-fort-greene-park/",
    "author": "Lauren Gill",
    "containsVideo": false
  },
  {
    "id": "33",
    "date": "2017-03-22",
    "title": "Neighbors feel left out of Ft. Greene Park makeover",
    "excerpt": "&quot;It would seem that the priority is to cater to the new luxury unit residents on Myrtle Avenue,&quot; said local Sandy Reiburn in a letter to park steward group the Fort Greene Park Conservancy, which supports the changes. &quot;Further discussions about monies spent and a redesign that seems **more about social engineering than about the best and most welcoming use of our park are warranted**.&quot;\n&quot;Half of us black folks didn't even know that you had a meeting in November — I certainly didn't,&quot; said one local from the Whitman Houses at the February gathering.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/neighbors-feel-left-out-of-ft-greene-park-makeover/",
    "author": "Ruth Brown",
    "containsVideo": false
  }
]