[
  {
    "id": "1",
    "date": "2025-07-15",
    "title": "Judge Dismisses Lawsuit, Allows Tree Removal",
    "excerpt": "On Friday, July 18, 2025, members of FFGP spoke with Brooklyn News 12 to voice their disappointment in the ruling. &quot;This decision represents a setback not only for Fort Greene Park but for all New Yorkers who believe in protecting our city&apos;s green spaces and honoring our shared historical and cultural heritage,&quot; said FFGP President Kelly Schaffer.\nDespite the court&apos;s decision, the group emphasized that their fight is far from over. FFGP vowed to continue mobilizing neighbors, raising awareness, and pressing city officials to adopt the community&apos;s counter-proposal — one that preserves the tree canopy, restores historic landscape features, and ensures the park remains accessible, sustainable, and welcoming for future generations.",
    "source": "News 12",
    "sourceUrl": "https://brooklyn.news12.com/judge-tosses-lawsuit-over-fort-greene-park-allowing-city-to-cut-down-trees ",
    "author": "Staff Reporter",
    "containsVideo": true
  },
  {
    "id": "2",
    "date": "2025-05-14",
    "title": "'Living for the City' Discusses Fort Greene Park Controversy",
    "excerpt": "During WBAI Radio&apos;s &quot;Living for the City&quot; program on May 14, 2025, hosts discussed Mt. Prospect Park and Fort Greene Park, explaining the situation well.",
    "category": "media",
    "source": "WBAI Radio",
    "sourceUrl": "https://www.google.com",
    "author": "WBAI Radio",
    "containsVideo": false
  },
  {
    "id": "3",
    "date": "2025-04-15",
    "title": "To tree, or not to tree? Advocates, city continue legal battle over Fort Greene Park revamp",
    "excerpt": "The lush but aging greenspace was chosen as one of eight city parks to be overhauled by the Parks Without Borders program in 2016. Nine years later, the projects have wrapped up in the other seven parks — but haven’t begun at Fort Greene.\nThat’s because a group of local activists, the Friends of Fort Greene Park, believe the project will do more harm than good, and doubt the city’s studies that say otherwise. In an effort to stall the project and demand more information about the plan, the Friends have filed three lawsuits against the city since 2018. ",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/legal-battle-trees-fort-greene-park/",
    "author": "Kirstyn Brendlen",
    "containsVideo": false
  },
  {
    "id": "4",
    "date": "2025-04-12",
    "title": "Advocates Battle NYC Parks Plan to Cut 78 Trees",
    "excerpt": "A Fort Greene nonprofit group took the city Parks Department to court on March 27, arguing the city agency failed to conduct a full environmental review before approving a $24 million redesign of Fort Greene Park that would result in the removal of 78 trees.\nFriends of Fort Greene Park (FFGP) argued that the Parks Department violated the State Environmental Quality Review Act (SEQRA), according to a press release.",
    "source": "BK Reader",
    "sourceUrl": "https://www.bkreader.com/non-profit-community/advocates-battle-nyc-parks-plan-to-cut-78-trees-in-fort-greene-park-10498705",
    "author": "BK Reader Staff",
    "containsVideo": false
  },
  {
    "id": "5",
    "date": "2025-04-03",
    "title": "Long-Running Controversy Over Fort Greene Tree Plan Continues",
    "excerpt": "The controversy over a $24 million redesign of Fort Greene Park, which will axe 78 mature trees, continues, according to Pix11. Set for 2026, the project swaps invasive Norway maples for 200 native ones, adds ADA entrances, and fixes drainage, per the park’s Conservancy, which says 30 of the trees are unhealthy, 24 are invasive and 24 threaten pipes. The Friends of Fort Greene Park, however, which has been fighting the plan since 2017, claims it skipped environmental reviews — decreasing shade, replacing green swaths with concrete and destroying park features designed by famous landscape artists.",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2025/04/03/long-running-controversy-over-fort-greene-tree-plan-continues/",
    "author": "Brooklyn Eagle Staff",
    "containsVideo": false
  },
  {
    "id": "6",
    "date": "2025-04-01",
    "title": "Residents Sue to Stop Tree Cutting in $24M Fort Greene Park Overhaul",
    "excerpt": "FOX5 New York reports that a $24 million project to redesign Fort Greene Park faces legal opposition from local residents. The plan calls for the removal of 78 trees to make way for pedestrian plazas and increased accessibility, but opponents say the project will harm the environment and community health. Residents filed a lawsuit arguing that tree loss will impact air quality, wildlife and shade in a neighborhood already affected by asthma and heat.",
    "source": "FOX5 New York",
    "sourceUrl": "https://www.youtube.com/watch?v=6y5V3RM7AgM",
    "author": "Kendall Green",
    "containsVideo": true
  },
  {
    "id": "7",
    "date": "2025-03-31",
    "title": "Brooklyn Residents Fight Plan to Chop Down 78 Trees",
    "excerpt": "Leaf these trees alone.\nPlant-loving locals are looking to block the city from chopping down 78 trees in Fort Greene Park – a move they say would turn the greenspace into a “summer frying pan.”\nA group of residents in Brooklyn’s trendy Fort Greene is suing the city and fighting with the parks conservancy over a plan for a pedestrian plaza despite officials pledging to replace the healthy trees with 300 saplings.",
    "source": "New York Post",
    "sourceUrl": "https://nypost.com/2025/03/31/us-news/locals-fight-plan-to-chop-down-78-healthy-trees-in-for-greene-park-saying-itll-create-a-summer-frying-pan/",
    "author": "Nicole Rosenthal",
    "containsVideo": false
  },
  {
    "id": "8",
    "date": "2025-03-27",
    "title": "'Tree Fight' Continues to Grow in Brooklyn",
    "excerpt": "Two organizations that want to make improvements to Fort Greene Park have been arguing for decades. As CBS News New York's Kristie Keleshian reports, the fight has made its way to court.",
    "source": "CBS News",
    "sourceUrl": "https://www.cbsnews.com/newyork/video/tree-fight-continues-to-grow-in-brooklyn/",
    "author": "Kristie Keleshian",
    "containsVideo": true
  }
]