[
  {
    "id": "1",
    "date": "2025-07-15",
    "title": "Judge Dismisses Lawsuit, Allows Tree Removal",
    "excerpt": "On Friday, July 18, 2025, members of FFGP spoke with Brooklyn News 12 to voice their disappointment in the ruling. &quot;This decision represents a setback not only for Fort Greene Park but for all New Yorkers who believe in protecting our city&apos;s green spaces and honoring our shared historical and cultural heritage,&quot; said FFGP President Kelly Schaffer.\nDespite the court&apos;s decision, the group emphasized that their fight is far from over. FFGP vowed to continue mobilizing neighbors, raising awareness, and pressing city officials to adopt the community&apos;s counter-proposal — one that preserves the tree canopy, restores historic landscape features, and ensures the park remains accessible, sustainable, and welcoming for future generations.",
    "source": "News 12",
    "sourceUrl": "https://brooklyn.news12.com/judge-tosses-lawsuit-over-fort-greene-park-allowing-city-to-cut-down-trees ",
    "author": "Staff Reporter",
    "containsVideo": true
  },
  {
    "id": "2",
    "date": "2025-05-14",
    "title": "'Living for the City' Discusses Fort Greene Park Controversy",
    "excerpt": "During WBAI Radio&apos;s &quot;Living for the City&quot; program on May 14, 2025, hosts discussed Mt. Prospect Park and Fort Greene Park, explaining the situation well.",
    "category": "media",
    "source": "WBAI Radio",
    "sourceUrl": "https://www.google.com",
    "author": "WBAI Radio",
    "containsVideo": false
  },
  {
    "id": "3",
    "date": "2025-04-15",
    "title": "To tree, or not to tree? Advocates, city continue legal battle over Fort Greene Park revamp",
    "excerpt": "The lush but aging greenspace was chosen as one of eight city parks to be overhauled by the Parks Without Borders program in 2016. Nine years later, the projects have wrapped up in the other seven parks — but haven’t begun at Fort Greene.\nThat’s because a group of local activists, the Friends of Fort Greene Park, believe the project will do more harm than good, and doubt the city’s studies that say otherwise. In an effort to stall the project and demand more information about the plan, the Friends have filed three lawsuits against the city since 2018. ",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/legal-battle-trees-fort-greene-park/",
    "author": "Kirstyn Brendlen",
    "containsVideo": false
  },
  {
    "id": "4",
    "date": "2025-04-12",
    "title": "Advocates Battle NYC Parks Plan to Cut 78 Trees",
    "excerpt": "A Fort Greene nonprofit group took the city Parks Department to court on March 27, arguing the city agency failed to conduct a full environmental review before approving a $24 million redesign of Fort Greene Park that would result in the removal of 78 trees.\nFriends of Fort Greene Park (FFGP) argued that the Parks Department violated the State Environmental Quality Review Act (SEQRA), according to a press release.",
    "source": "BK Reader",
    "sourceUrl": "https://www.bkreader.com/non-profit-community/advocates-battle-nyc-parks-plan-to-cut-78-trees-in-fort-greene-park-10498705",
    "author": "BK Reader Staff",
    "containsVideo": false
  },
  {
    "id": "5",
    "date": "2025-04-03",
    "title": "Long-Running Controversy Over Fort Greene Tree Plan Continues",
    "excerpt": "The controversy over a $24 million redesign of Fort Greene Park, which will axe 78 mature trees, continues, according to Pix11. Set for 2026, the project swaps invasive Norway maples for 200 native ones, adds ADA entrances, and fixes drainage, per the park’s Conservancy, which says 30 of the trees are unhealthy, 24 are invasive and 24 threaten pipes. The Friends of Fort Greene Park, however, which has been fighting the plan since 2017, claims it skipped environmental reviews — decreasing shade, replacing green swaths with concrete and destroying park features designed by famous landscape artists.",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2025/04/03/long-running-controversy-over-fort-greene-tree-plan-continues/",
    "author": "Brooklyn Eagle Staff",
    "containsVideo": false
  },
  {
    "id": "6",
    "date": "2025-04-01",
    "title": "Residents Sue to Stop Tree Cutting in $24M Fort Greene Park Overhaul",
    "excerpt": "FOX5 New York reports that a $24 million project to redesign Fort Greene Park faces legal opposition from local residents. The plan calls for the removal of 78 trees to make way for pedestrian plazas and increased accessibility, but opponents say the project will harm the environment and community health. Residents filed a lawsuit arguing that tree loss will impact air quality, wildlife and shade in a neighborhood already affected by asthma and heat.",
    "source": "FOX5 New York",
    "sourceUrl": "https://www.youtube.com/watch?v=6y5V3RM7AgM",
    "author": "Kendall Green",
    "containsVideo": true
  },
  {
    "id": "7",
    "date": "2025-03-31",
    "title": "Brooklyn Residents Fight Plan to Chop Down 78 Trees",
    "excerpt": "Leaf these trees alone.\nPlant-loving locals are looking to block the city from chopping down 78 trees in Fort Greene Park – a move they say would turn the greenspace into a “summer frying pan.”\nA group of residents in Brooklyn’s trendy Fort Greene is suing the city and fighting with the parks conservancy over a plan for a pedestrian plaza despite officials pledging to replace the healthy trees with 300 saplings.",
    "source": "New York Post",
    "sourceUrl": "https://nypost.com/2025/03/31/us-news/locals-fight-plan-to-chop-down-78-healthy-trees-in-for-greene-park-saying-itll-create-a-summer-frying-pan/",
    "author": "Nicole Rosenthal",
    "containsVideo": false
  },
  {
    "id": "8",
    "date": "2025-03-27",
    "title": "'Tree Fight' Continues to Grow in Brooklyn",
    "excerpt": "Two organizations that want to make improvements to Fort Greene Park have been arguing for decades. As CBS News New York's Kristie Keleshian reports, the fight has made its way to court.",
    "source": "CBS News",
    "sourceUrl": "https://www.cbsnews.com/newyork/video/tree-fight-continues-to-grow-in-brooklyn/",
    "author": "Kristie Keleshian",
    "containsVideo": true
  },
  {
    "id": "9",
    "date": "2021-04-14",
    "title": "State Pol Calls On City To Rethink Embattled Fort Greene Park Redesign",
    "excerpt": "Parks Department lumberjacks will be chopping down trees in Fort Greene Park as part of a recently-relaunched $24 million makeover. Locals worry that, as in 2017, officials might again exaggerate the number of sick trees to justify removals.\n&quot;We would oppose the removal of healthy mature shade trees for design purposes,&quot; said Michael Braun. Attorney Richard Lippes added that the city must provide full transparency and comply with environmental review requirements.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/state-pol-calls-on-city-to-rethink-embattled-fort-greene-park-redesign/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "10",
    "date": "2020-09-18",
    "title": "Residents Demand Answers From City On Embattled Fort Greene Park Revamp",
    "excerpt": "The Parks Department adjusted the proposal&apos;s timeline, paving the way for a 12–18 month construction process. Activists accused officials of forcing through an unpopular and legally questionable proposal.\n&quot;They have to produce a piece of paper [saying] why they believe that they&apos;re not subject to SEQR,&quot; said attorney Michael Gruen. Residents feared the agency was again ignoring concerns, with Monique Cumberbatch warning, &quot;It just goes to show you the lengths they&apos;re willing to go through while being untruthful.&quot;",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/residents-demand-answers-from-city-on-embattled-fort-greene-park-revamp/",
    "author": "Tramane Harris",
    "containsVideo": false
  },
  {
    "id": "11",
    "date": "2020-05-20",
    "title": "State Pol Calls On City To Rethink Embattled Fort Greene Park Redesign",
    "excerpt": "&quot;We don&apos;t want to take out trees that have longevity in front of them and replace them with immature trees that would take decades to become mature,&quot; Assemblyman Walter Mosley said. He emphasized the importance of preserving existing green space.\nThe section of the park across from public housing has not seen significant investment since the 1970s, unlike the southern half near Dekalb Avenue. Locals also worried the redesign could spur gentrification.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/state-pol-rethink-fort-greene-park-redesign/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "12",
    "date": "2020-05-01",
    "title": "The Battle of Fort Greene",
    "excerpt": "For generations, towering trees in the northwest corner of Fort Greene Park have sheltered outdoor celebrations for nearby NYCHA residents.\n&quot;This is the reason I stayed in Brooklyn,&quot; said Stacy Williams, watching her granddaughter play atop the mounds. She opposed the city&apos;s plan to replace the grassy landforms with concrete, saying, &quot;The park don&apos;t really need this glamorous thing you&apos;re putting in it.&quot;",
    "source": "Landscape Architecture Magazine",
    "sourceUrl": "https://landscapearchitecturemagazine.org/2020/05/01/the-battle-of-fort-greene/",
    "author": "Tom Stoelker",
    "containsVideo": false
  },
  {
    "id": "13",
    "date": "2020-02-19",
    "title": "Longtime residents: Don’t gentrify Fort Greene Park",
    "excerpt": "City lawyers filed a notice of appeal against a judge&apos;s order requiring evidence that the $10.5 million park overhaul — including felling 83 trees — would not significantly impact the neighborhood. The ruling had sided with local environmental advocates opposing the redesign.",
    "source": "Brooklyn Paper",
    "sourceUrl": "https://www.brooklynpaper.com/longtime-residents-dont-gentrify-fort-greene-park/",
    "author": "Kevin Duggan",
    "containsVideo": false
  },
  {
    "id": "14",
    "date": "2020-01-14",
    "title": "Fort Greene Park Trees Get Stay Of Execution",
    "excerpt": "&quot;The Parks Department fell short in its responsibilities to be transparent and accountable throughout its Parks Without Borders design process,&quot; said Friends of Fort Greene President Ling Hsu. She celebrated the ruling that temporarily halted tree removal, adding, &quot;Fort Greene residents came together and prevailed in two lawsuits in a row, saving mature trees from the meaningless destruction the city intended.&quot;",
    "source": "Kings County Politics",
    "sourceUrl": "https://www.kingscountypolitics.com/fort-greene-park-trees-get-stay-of-execution/",
    "author": "Chaya Gurkov",
    "containsVideo": false
  },
  {
    "id": "15",
    "date": "2020-01-13",
    "title": "Fort Greene Park Trees Saved As Locals Beat City In Court",
    "excerpt": "Friends of Fort Greene Park won the second of two lawsuits blocking plans to cut down 83 trees in the park.\n&quot;This decision should awaken the Department to reality,&quot; said legal advisor Michael Gruen. Residents like Georgette Poe and Arija Flowers hailed the ruling as protecting their community&apos;s green space: &quot;Parks are supposed to be about trees and green spaces, birds and bees. We don&apos;t need another paved plaza.&quot;",
    "source": "Patch",
    "sourceUrl": "https://patch.com/new-york/fortgreene/fort-greene-park-trees-saved-locals-beat-city-court",
    "author": "Kathleen Culliton",
    "containsVideo": false
  },
  {
    "id": "16",
    "date": "2020-01-13",
    "title": "City's plan to remove trees from Fort Greene Park hits a snag",
    "excerpt": "A state Supreme Court judge criticized the Parks Department&apos;s justification for removing trees. Though officials said 267 replacements would be planted, the judge ruled their explanation lacked detail on potential adverse impacts to aesthetics, culture, and neighborhood character.",
    "source": "Brooklyn Daily Eagle",
    "sourceUrl": "https://brooklyneagle.com/articles/2020/01/13/citys-plan-to-remove-trees-from-fort-greene-park-hits-a-snag/",
    "author": "Lore Croghan",
    "containsVideo": false
  },
  {
    "id": "17",
    "date": "2020-01-13",
    "title": "Judge Halts City's Plan To Raze Dozens Of Trees In Fort Greene Park",
    "excerpt": "In a key victory for activists, a state Supreme Court judge ordered the city to reassess the renovation plan that would have razed more than 80 trees.\n&quot;It is heartening to see that Justice Rodriguez also recognizes that the Parks Department failed to adequately assess the implications of its design decision,&quot; said Kate Bartholomew of the Sierra Club.",
    "source": "Gothamist",
    "sourceUrl": "https://gothamist.com/news/judge-halts-citys-plan-to-raze-dozens-of-trees-in-fort-greene-park",
    "author": "Elizabeth Kim",
    "containsVideo": false
  }  
]